import React from 'react';
import './Text.css';
import '../GlobalPageSetting.css';

import { FormattedMessage } from 'react-intl';
import { Link } from 'react-router-dom';
import Img from '../../components/Img/index';


export default function Text() {
  return (
    <div className="page_content">
      <h1>Вступ на 1 курс (сертифікат ЗНО)</h1>
      <div className="container_start_entry">
        <p>Кафедра інформаційно-телекомінікаційних мереж готує фахівців за</p>
        <h2>СПЕЦІАЛЬНІСТЮ 172: ТЕЛЕКОМУНІКАЦІЇ ТА РАДІОТЕХНІКА</h2>
        <h3>(ГАЛУЗЬ ЗНАНЬ 17: ЕЛЕКТРОНІКА ТА ТЕЛЕКОМУНІКАЦІЇ)</h3>
      </div>
      <p><b>за освітньою програмою:</b></p>
      <Link to='/educational_program'><p><span className="link_with_line">Інженерія та програмування інфокомунікацій</span></p></Link>
      <p><b>1-й рівень вищої освіти:</b></p>
      <ul>
        <li>
          <b><strong>Бакалавр - 3 роки 10 місяців (денна форма навчання)</strong></b>
        </li>
      </ul>
      
        <table className = "content_steps_for_entering">
          <thead>
            <tr>
              <td colSpan="3">
                <h3>Етапи вступної кампанії</h3>  
                <p><b>(вступники на основі повної загальної середньої освіти)</b></p>
              </td>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td colSpan="2">
                <p>Початок реєстрації електронних кабінетів вступників, завантаження додатків до документів про повну загальну середню освіту</p>
              </td>
              <td>
                <p>01 липня — 22 липня 2019 р.</p>
              
              </td>
            </tr>
            <tr>
              <td colSpan="2">
              <p>Початок прийому заяв та документів</p>
              
              </td>
              <td>
              <p>10 липня 2019 р.</p>
              
              </td>
            </tr>
            <tr>
              <td colSpan="2">
              <p>Закінчення прийому заяв та документів на основі ЗНО</p>
              
              </td>
              <td>
              <p>22 липня 2019 р., 18-00</p>
              
              </td>
            </tr>
            <tr>
              <td colSpan="2">
              <p>Терміни оприлюднення рейтингового списку вступників із зазначенням рекомендованих до зарахува​ння на місця державного замовлення</p>
              
              </td>
              <td>
              <p>не пізніше 26 липня 2019 р.</p>
              
              </td>
            </tr>
            <tr>
              <td colSpan="2">
              <p>Закінчення строку виконання вступниками вимог до зарахування на місця державного замовлення</p>
              
              </td>
              <td>
              <p>не пізніше 18.00 31 липня 2019 року</p>
              
              </td>
            </tr>
            <tr>
              <td colSpan="2">
              <p>Закінчення строку виконання вступниками, які отримали рекомендацію, вимог до зарахування на місця, що фінансуються за кошти фізичних та юридичних осіб</p>
              
              </td>
              <td>
              <p>не пізніше 17.00 06 серпня 2019 року </p>
              
              </td>
            </tr>
            <tr>
              <td rowSpan = "2">
                <p>Терміни зарахування вступників</p>
              </td>
              <td>
                <p>за державним замовленням</p>
              </td>
              <td>
                <p>не пізніше 12.00 01 серпня 2019 року</p>
              </td>
            </tr>
            <tr>
              <td>
                <p>за кошти фізичних та юридичних осіб</p>
                
              </td>
              <td>
                  <p>не пізніше 07 серпня 2019 року</p>
                </td>
            </tr>
          </tbody>
        </table>
    
      <div className="numerical_table_header">
        <h4>У 2019 році приймаються сертифікати зовнішнього незалежного оцінювання 2017, 2018 та 2019 років,
           крім оцінок з англійської, французької, німецької та іспанської мов, результати яких приймаються лише
            із сертифікатів зовнішнього незалежного оцінювання 2018 та 2019 року
        </h4>
        <p>Перелік сертифікатів ЗНО</p>
        <table className="numerical_table">
          <tbody>
            <tr>
              <th>
                Перелік конкурсних предметів (вступних іспитів)
              </th>
              <th>
                Вага предметів
              </th>
              <th>
                Мінімальна кількість балів для допуску до участі в конкурсі або для зарахування на
                 навчання поза конкурсом
              </th>
            </tr>
            <tr>
              <td>1. Українська мова та література</td>
              <td>0,2</td>
              <td>100</td>
            </tr>
            <tr>
              <td>2. Математика</td>
              <td>0,5</td>
              <td rowSpan="2">Один не менше 125 за умови, що інший не менше 100</td>
            </tr>
            <tr>
              <td>3. Фізика або Іноземна мова (Англійська мова; Французька мова; Німецька мова; Іспанська мова)</td>
              <td>0,2</td>
            </tr>
          </tbody>
        </table>
        </div>
        <p>
          <strong>Вага атестату - 0,05</strong>
          <br/>
          <strong>Вага бала за успішне закінчення підготовчих курсів ВНЗ - 0,05</strong>
          <br/>
          <strong>Максимальний конкурсний бал - 200</strong>
          <br/>
        </p>
      </div>
  );
}
