import React from 'react';
import '../GlobalPageSetting.css';
import './index.css';
import {Link} from 'react-router-dom';


export default function Why(){
    return(
        <div>
            <div className='topimage'/>
            <div className='paragraph'>
            <div className='page_content'>
                    <h1 id ='whystring'>Шановні Абітурієнти</h1>
                    <div className='textwhy'>
                        Ви кожного дня використовуєте «хмарні» послуги
                        та різноманітні гаджети? Ви вже є частиною
                        інформаційного суспільства?
                        Як відомо, домінуючою стратегією розвитку
                        цивілізованих країн стає концепція інформаційного
                        суспільства, в якому матеріальною основою стають
                        інформаційно-телекомунікаційні технології та
                        системи, де тісно переплітаються завдання
                        формування, зберігання, обробки та вільного
                        обміну в необмеженому просторовому ресурсі
                        значних обсягів інформації, які рухаються від
                        джерел до чисельних споживачів.
                        Якщо ви бажаєте розвивати та створювати
                        складові інформаційного суспільства, вам до нас!
                    </div>
                </div>
                <div className='page_content'>
                    <h1 id ='whystring'>Чому ТІ?</h1>
                    <p className='textwhy'>
                        <Link className='kafedrastring'>Кафедра інформаційно-телекомунікаційних мереж</Link>
                        здійснює підготовку фахівців у напрямку
                        створення та підтримки послуг, які надаються
                        користувачам у цифровому глобальному
                        середовищі. Випускники володіють знаннями,
                        вміннями та навичками, що дозволяє їм
                        аналізувати та впроваджувати телекомунікаційні
                        технології, розробляти програмне забезпечення
                        доступу та обміну інформацією, доступу до Сloud-
                        ресурсів, виконувати моніторинг, проводити
                        моделювання, системний аналіз, дослідження
                        операцій, забезпечувати захист інформації в
                        інформаційно-телекомунікаційному середовищі.Ти
                        знатимеш і вмітимеш розробляти та підтримувати такі системи.
                    </p>
                </div>
                <div className ='page_content'>
                    <h1 id ='whystring'>Що з цього вийде</h1>
                    <div className='textwhy'>
                    Після проходження навчання за обраною спеціалізацією з Вас вийде фахівець,
                    який без зусиль зможе знайти роботу в центрах обробки даних та з програмними сервісами міжнародних та
                    вітчизняних телекомунікаційних компаній, в структурах ІТ-оператора, компаніях мобільного оператора, 
                    в ІТ-компаніях, що застосовують програмно-визначальні базові мережі, надають послуги зв'язку та Internet, 
                    у фірмах-розробниках спеціального ПЗ, в технічних відділах банків та організацій різних форм власності, 
                    що використовують мережні технології​.
                    </div>
                </div>
            </div>
        </div>
    )
}