import React from 'react';
import './index.css';
import Headlines from '../../components/Study_Header/main';
import Process from '../../components/Study_process/index';
import SubjectBachelors from '../../components/Study_SubjectBachelor/index';
import SubjectMaster from '../../components/Study_SubjectMaster/index';
import PracticeFinal from '../../components/Study_PracticeFinal/index';

export default function StudyPage() {
  return (
    <div id="main">
      <Headlines />
      <Process />
      <h2>Перелік предметів бакалаврів</h2>
      <SubjectBachelors />
      <h3>Перелік предметів магістрів</h3>
      <SubjectMaster />
      <h4>Практика</h4>
      <article className="practice">
        <p>
          Практична підготовка студентів є обов´язковим компонентом
          освітньо-професійної програми для здобуття кваліфікаційного рівня і
          має на меті на буття ними професійних навичок та вмінь. Мета практики
          — оволодіння студентами сучасними методами, формами, засобами
          майбутньої професійної діяльності в галузі телекомунікацій, її
          організації, професійних умінь і навичок для прийняття самостійних
          рішень під час конкретної роботи в реальних ринкових і виробничих
          умовах, виховання потреби систематично поновлювати свої знання та
          творчо їх застосовувати в практичній діяльності.
        </p>

        <p>
          В процесі практики студенти також набувають досвіду суспільної,
          організаторської та виховної роботі в колективі. Поставлена мета
          досягається шляхом вирішення конкретних задач стосовно кожного виду
          практики:
        </p>

        <ul id="diploma_practice">
          <li>
            Переддипломна практика (4 курс, 6 курс). Під час цієї практики
            поглиблюються та закріплюються теоретичні знання з усіх дисциплін
            навчального плану, збирається фактичний матеріал для виконання
            кваліфікаційної роботи, дипломного проекту.
          </li>

          <li>
            Науково-дослідна практика (6 курс - магістри). Науково-дослідна
            практика магістрів є обов'язковим компонентом освітньо-професійної
            програми для здобуття кваліфікаційного рівня магістра з
            телекомунікацій і має на меті набуття студентом професійних навичок
            та вмінь здійснення самостійної наукової-дослідної роботи.​
          </li>
        </ul>

        <strong>Обов'язки студента-практиканта:</strong>
        <ul id="student_practice_list">
          <li>
            Повністю виконати завдання, які передбачені програмою практики.
          </li>
          <li>
            Студенти зобов’язані в відповідності з графіком прибувати до місця
            практики, виконувати вимоги внутрішнього розпорядку.
          </li>
          <li>На протязі проходження практики вести щоденник.</li>
          <li>
            Своєчасно подати керівникові практики письмовий звіт про виконання
            всіх завдань та щоденник.
          </li>
          <li>Скласти залік з практики.</li>
        </ul>

        <p className="practice_final">
          Чітке дотримання правил охорони праці і техніки безпеки під час
          проходження практики є обов'язковим для всіх студентів.{' '}
        </p>

        <p className="practice_final">
          За два тижні до початку практики студенти повинні пройти загальний
          інструктаж з техніки безпеки, а безпосередньо перед початком екскурсій
          практики інструктаж з охорони праці на об’єкті практики (на робочому
          місці).​​
        </p>

        <PracticeFinal />
      </article>
    </div>
  );
}
