import React from 'react';
import './Text.css';

import Img from '../../components/Img/index';

import ForEntrant from '../../components/ForEntrant/index'
import { FormattedMessage } from 'react-intl';
import Table from '../../components/Table/index';
import WordLink from '../../components/WordLink';
import { Link } from 'react-router-dom';

import image_Benefits from './images/Benefits.png'
import image_diagram from './images/diagram.gif'

export default function Text(){
    return(
        <div className = 'text'>
            <div className = "Information_for_Students">
                <h1>Вступ</h1>
                <ForEntrant/>
            </div>
            <hr/>
            <h2>Спеціалізація «ІНФОРМАЦІЙНО-КОМУНІКАЦІЙНІ ТЕХНОЛОГІЇ»</h2>
            <p>
                <b>Спеціалізація <i>«Інформаційно-комунікаційні технології» </i></b>
                 забезпечує фундаментальну теоретичну та прикладну практичну підготовку за загальною програмою 
                 <b> галузі ​знань <i>«Електроніка та телекомунікації»</i></b>,  
                 <b> спеціальності <i>«Телекомунікації та радіотехніка» </i></b>
                  на трьох рівнях вищої освіти: бакалавр, магістр, доктор філософії.
            </p>
            <Img src={image_Benefits}  id = 'image_Benefits'/>
            <p><b>Спеціалізація</b> спрямована на опанування випускниками спеціальних знань із:
                <ul className = "benefits">
                    <li>проектування гетерогенних програмно-апаратних платформ, які забезпечують отримання сучасних Інтернет-послуг та сервісів у будь-який час і у будь-якому місці, працюють в глобальному середовищі;</li>
                    <li>проектування «хмарних» (програмно визначуваних) дата-центрів у поєднанні з сучасними 3G, 4G та 5G- комунікаційними мережами;</li>
                    <li>створення та використання новітніх технологій IoT (Internet of Things), а також побудова інформаційно-комунікаційних систем на їх основі;</li>
                    <li>проектування програмно-апаратних платформ, вузлів обробки даних, інтелектуальних засобів їх взаємодії;</li>
                    <li>створення енергоефективних інтелектуальних   ​протоколів та засобів паралельної, колективної ​обробки значних обсягів інформації у вузлах дата-центрів, застосування «хмарних ресурсів та сервісів».​</li>
                </ul>
            </p>
            <p>Кафедра  телекомунікацій займає найвищі позиції у рейтингу університету, зокрема, за рейтингами науково-педагогічних працівників, науково-інноваційної діяльності, індексом творчих досягнень студентів, активності міжнародної діяльності.</p>
            <p>Після проходження навчання студенти без зусиль знаходять роботу в сфері інфотелекомунікацій. Наші Випускники працюють на інженерних та управлінських посадах провідних підприємств, організацій та їх представництв: в сфері електроніки, телекомунікацій, програмного забезпечення і інформаційних технологій. Зокрема, Alcatel-Lucent, Nokia Corporation, Lifecell (Астеліт), Vodafone (МТС), Укртелеком, Київстар та інш.</p>
            <hr/>
            <Link>
                <h4>Положення про кафедру технічної кібернетики ФІОТ КПІ ім.Ігоря Сікорського</h4>
            </Link>  
            <hr/>
            <h4>ФАХОВІ РІВНІ ПІДГОТОВКИ</h4> 
            <Table/>
            <hr/>
            <h4>НАПРЯМИ ПІДГОТОВКИ</h4>
            <Img src={image_diagram}  className = 'image_diagram'/>
            <hr/>
        </div>
    );
}