import React from 'react';
import './Text.css';
import '../GlobalPageSetting.css';

import { FormattedMessage } from 'react-intl';
import { Link } from 'react-router-dom';
import Img from '../../components/Img/index';

export default function Text() {
  return (
    <div className="page_content">
      <h1>Доктор філософії (PhD)</h1>
      <h3>3-й рівень вищої освіти (Доктор філософії (PhD))</h3>
      <h3>Підготовка аспірантів і магістрів проводиться в галузі знань:</h3>
      <strong>17  Електроніка та  телекомунікації</strong>
      <p>по спеціальності: 172 Телекомунікації та радіотехніка і у відповідності до Спеціалізованої Вченої Ради із захисту докторських та кандидатських дисертацій
         КПІ ім. І. Сікорського Д 26.002.14 за паспортами наступних наукових спеціальностей:
      </p>
      <ul>
        <li>05.12.02 – Телекомунікаційні системи та мережі;</li>
        <li>05.12.13 – Радіотехнічні пристрої та засоби телекомунікацій;</li>
        <li>05.12.17 – Радіотехнічні та телевізійні системи;</li>
        <li>05.12.07 – Антени та пристрої мікрохвильової техніки;</li>
      </ul>
      <p>зокрема включає наступні напрями:</p>
      <ul>
        <li>Методи управління і оцінка ефективності функціонування телекомунікаційних мереж на базі IP/MPLS, MetroEthernet, DWDM та ін.</li>
        <li>Стільникові мережі мобільного зв’язку  5G</li>
        <li>Технології систем міжмашинної взаємодії М2М та Інтернет-речей</li>
        <li>Програмно-визначувані радіосистеми з використанням модельно-орієнтованого проектування</li>
        <li>Телекомунікаційні мережі, що програмно конфігуруються SDN</li>
        <li>Віртуалізація мережних функцій для мобільних систем на базі хмарної інфраструктури</li>
        <li>Телекомунікаційні системи міліметрового та терагерцового діапазонів</li>
        <li>Принципи кооперативної ретрансляція та когнітивності в безпроводових телекомунікаційних системах</li>
        <li>Надширокосмугові імпульсні сигнали та їх використання в телекомунікаціях</li>
        <li>Безпроводові сенсорні мережі</li>
        <li>Мікрохвильові пристрої телекомунікаційних систем​</li>
      </ul>
      <br/>
      <p><b>Програма фахового випробування</b></p>
      <a><p><span className="link_with_line">Програма з підготовки аспірантів (PhD) кафедри_ТК_2019.pdf</span></p></a>     
      </div>
  );
}
